tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf14k22_tdd.h
#define SSPOV                         522
#define WCOL                          523
#define SSPSTAT                       524
#define BF                            525
#define UA                            526
#define R_NOT_W                       527
#define NOT_W                         528
#define nW                            529
#define RW                            530
#define nWRITE                        531
#define R                             532
#define W                             533
#define NOT_WRITE                     534
#define R_nW                          535
#define R_W                           536
#define START                         537
#define S                             538
#define STOP                          539
#define P                             540
#define A                             541
#define NOT_A                         542
#define nA                            543
#define D_A                           544
#define D_nA                          545
#define D                             546
#define DA                            547
#define D_NOT_A                       548
#define NOT_ADDRESS                   549
#define nADDRESS                      550
#define CKE                           551
#define SMP                           552
#define T2CON                         553
#define T2CKPS0                       554
#define T2CKPS                        555
#define T2CKPS1                       556
#define TMR2ON                        557
#define T2OUTPS0                      558
#define T2OUTPS                       559
#define T2OUTPS1                      560
#define T2OUTPS2                      561
#define T2OUTPS3                      562
#define PR2                           563
#define WM0                           564
#define WM1                           565
#define WAIT0                         566
#define WAIT1                         567
#define EBDIS                         568
#define T1CON                         569
#define TMR1ON                        570
#define TMR1CS                        571
#define NOT_T1SYNC                    572
#define T1SYNC                        573
#define nT1SYNC                       574
#define T1OSCEN                       575
#define SOSCEN                        576
#define T1CKPS0                       577
#define T1CKPS                        578
#define T1CKPS1                       579
#define T1RUN                         580
#define T1CON_RD16                    581
#define T1RD16                        582
#define RCON                          583
#define BOR                           584
#define NOT_BOR                       585
#define nBOR                          586
#define POR                           587
#define nPOR                          588
#define NOT_POR                       589
#define PD                            590
#define nPD                           591
#define NOT_PD                        592
#define NOT_TO                        593
#define nTO                           594
#define TO                            595
#define nRI                           596
#define NOT_RI                        597
#define RI                            598
#define SBOREN                        599
#define IPEN                          600
#define WDTCON                        601
#define SWDTE                         602
#define SWDTEN                        603
#define OSCCON2                       604
#define LFIOFS                        605
#define HFIOFL                        606
#define PRI_SD                        607
#define OSCCON                        608
#define SCS0                          609
#define SCS                           610
#define SCS1                          611
#define FLTS                          612
#define HFIOFS                        613
#define OSTS                          614
#define IRCF                          615
#define IRCF0                         616
#define IRCF1                         617
#define IRCF2                         618
#define IDLEN                         619
#define T0CON                         620
#define T0PS                          621
#define T0PS0                         622
#define T0PS1                         623
#define T0PS2                         624
#define PSA                           625
#define T0SE                          626
#define T0CS                          627
#define T08BIT                        628
#define TMR0ON                        629
#define STATUS                        630
#define C                             631
#define CARRY                         632
#define DC                            633
#define ZERO                          634
#define Z                             635
#define OV                            636
#define OVERFLOW                      637
#define N                             638
#define NEGATIVE                      639
#define INTCON3                       640
#define INT1IF                        641
#define INT1F                         642
#define INT2IF                        643
#define INT2F                         644
#define INT1E                         645
#define INT1IE                        646
#define INT2IE                        647
#define INT2E                         648
#define INT1P                         649
#define INT1IP                        650
#define INT2IP                        651
#define INT2P                         652
#define INTCON2                       653
#define RABIP                         654
#define RBIP                          655
#define TMR0IP                        656
#define INTEDG2                       657
#define INTEDG1                       658
#define INTEDG0                       659
#define nRABPU                        660
#define NOT_RABPU                     661
#define NOT_RBPU                      662
#define nRBPU                         663
#define RABPU                         664
#define INTCON                        665
#define RABIF                         666
#define RBIF                          667
#define INT0F                         668
#define INT0IF                        669
#define T0IF                          670
#define TMR0IF                        671
#define RABIE                         672
#define RBIE                          673
#define INT0E                         674
#define INT0IE                        675
#define T0IE                          676
#define TMR0IE                        677
#define PEIE                          678
#define PEIE_GIEL                     679
#define PIE                           680
#define GIEL                          681
#define GIE_GIEH                      682
#define GIE                           683
#define GIEH                          684
#define SP0                           685
#define STKPTR                        686
#define SP1                           687
#define SP2                           688
#define SP3                           689
#define SP4                           690
#define STKUNF                        691
#define STKOVF                        692
#define STKFUL                        693

#endif // _PIC18LF14K22_H_
